# Datetime en Pandas DataFrame

In [1]:
import pandas as pd
import numpy as np



### 1. Fechas y horas en Python
Los objetos básicos de Python para trabajar con fechas y horas residen en el módulo incorporado ``datetime``.
Junto con el módulo de terceros ``dateutil``, puedes utilizarlo para realizar rápidamente una serie de funciones útiles sobre fechas y horas.
Por ejemplo, puedes construir manualmente una fecha utilizando el tipo ``datetime``:

In [2]:
from datetime import datetime
datetime(year = 2015, month = 7, day = 4)

datetime.datetime(2015, 7, 4, 0, 0)

O, utilizando el módulo ``dateutil``, puedes analizar fechas a partir de una gran variedad de formatos de cadena:

In [3]:
# https://dateutil.readthedocs.io/en/stable/parser.html#functions
from dateutil import parser
print(parser.parse("4th of July, 2015"))
print(parser.parse("07/04/2015"))
print(parser.parse("07/04/2015", dayfirst=True))

2015-07-04 00:00:00
2015-07-04 00:00:00
2015-04-07 00:00:00

In [4]:
print(parser.parse("7/4/2015"))
print(parser.parse("07-04-2015"))
print(parser.parse("2015-07-04"))

2015-07-04 00:00:00
2015-07-04 00:00:00
2015-07-04 00:00:00

Una vez que tienes un objeto ``datetime``, puedes hacer cosas como imprimir el día de la semana:

In [6]:
# https://docs.python.org/3/library/datetime.html#strftime-and-strptime-behavior
datetime(year = 1986, month = 1, day = 7).strftime('%A')

'Tuesday'

### 2. Dates y Times en numpy

In [7]:
import numpy as np
date = np.array('2015-07-04', dtype = np.datetime64)
date

array('2015-07-04', dtype='datetime64[D]')

In [8]:
np.array('07-04-2015', dtype = np.datetime64)

ValueError: Cannot create a NumPy datetime other than NaT with generic units

Una vez que tenemos esta fecha formateada, además, podemos hacer rápidamente operaciones vectoriales sobre ella:

In [10]:
date

array('2015-07-04', dtype='datetime64[D]')

In [9]:
np.arange(14)

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13])

In [11]:
dates = date + np.arange(12)
dates

array(['2015-07-04', '2015-07-05', '2015-07-06', '2015-07-07',
       '2015-07-08', '2015-07-09', '2015-07-10', '2015-07-11',
       '2015-07-12', '2015-07-13', '2015-07-14', '2015-07-15'],
      dtype='datetime64[D]')

In [12]:
dates[0].astype('datetime64[Y]')

numpy.datetime64('2015')

Aquí tienes un datetime basado en minutos:

In [13]:
np.datetime64('2015-07-04 12:00:30')

numpy.datetime64('2015-07-04T12:00:30')

Fíjate en que la zona horaria **se ajusta automáticamente a la hora local del ordenador que ejecuta el código**.
Puedes forzar cualquier unidad deseada utilizando uno de los muchos códigos de formato; por ejemplo, aquí forzaremos un tiempo basado en nanosegundos.

La siguiente tabla, extraída de la [NumPy datetime64 documentation](http://docs.scipy.org/doc/numpy/reference/arrays.datetime.html), enumera los códigos de formato disponibles junto con los intervalos de tiempo relativos y absolutos que pueden codificar:

|Code    | Meaning     | Time span (relative) | Time span (absolute)   |
|--------|-------------|----------------------|------------------------|
| ``Y``  | Year	       | ± 9.2e18 years       | [9.2e18 BC, 9.2e18 AD] |
| ``M``  | Month       | ± 7.6e17 years       | [7.6e17 BC, 7.6e17 AD] |
| ``W``  | Week	       | ± 1.7e17 years       | [1.7e17 BC, 1.7e17 AD] |
| ``D``  | Day         | ± 2.5e16 years       | [2.5e16 BC, 2.5e16 AD] |
| ``h``  | Hour        | ± 1.0e15 years       | [1.0e15 BC, 1.0e15 AD] |
| ``m``  | Minute      | ± 1.7e13 years       | [1.7e13 BC, 1.7e13 AD] |
| ``s``  | Second      | ± 2.9e12 years       | [ 2.9e9 BC, 2.9e9 AD]  |
| ``ms`` | Millisecond | ± 2.9e9 years        | [ 2.9e6 BC, 2.9e6 AD]  |
| ``us`` | Microsecond | ± 2.9e6 years        | [290301 BC, 294241 AD] |
| ``ns`` | Nanosecond  | ± 292 years          | [ 1678 AD, 2262 AD]    |
| ``ps`` | Picosecond  | ± 106 days           | [ 1969 AD, 1970 AD]    |
| ``fs`` | Femtosecond | ± 2.6 hours          | [ 1969 AD, 1970 AD]    |
| ``as`` | Attosecond  | ± 9.2 seconds        | [ 1969 AD, 1970 AD]    |

### 3. Fechas y horas en Pandas

#### Argumentos por defecto

In [14]:
df = pd.DataFrame({'date': ['3/10/2000', '3/11/2000', '3/12/2000'],
                   'value': [2, 3, 4]})
df

        date  value
0  3/10/2000      2
1  3/11/2000      3
2  3/12/2000      4

In [15]:
df.dtypes

date     object
value     int64
dtype: object

In [16]:
df['date'] = pd.to_datetime(df['date'])
df

        date  value
0 2000-03-10      2
1 2000-03-11      3
2 2000-03-12      4

In [17]:
df.dtypes

date     datetime64[ns]
value             int64
dtype: object

#### Formato para el primer día

In [18]:
df = pd.DataFrame({'date': ['3/10/2000', '3/11/2000', '3/12/2000'],
                   'value': [2, 3, 4]})

df['date'] = pd.to_datetime(df['date'], dayfirst=True)
df

        date  value
0 2000-10-03      2
1 2000-11-03      3
2 2000-12-03      4

#### Formato personalizado

In [19]:
df = pd.DataFrame({'date': ['2016-6-10 20:30:0', 
                            '2016-7-1 19:45:30', 
                            '2013-10-12 4:5:1'],
                   'value': [2, 3, 4]})

df['date'] = pd.to_datetime(df['date'], format="%Y-%m-%d %H:%M:%S")
df

                 date  value
0 2016-06-10 20:30:00      2
1 2016-07-01 19:45:30      3
2 2013-10-12 04:05:01      4

#### Trabajando con error de análisis

In [20]:
df = pd.DataFrame({'date': ['3/10/2000', 'a/11/2000', '3/12/2000'],
                   'value': [2, 3, 4]})

df['date'] = pd.to_datetime(df['date'])

ParserError: Unknown string format: a/11/2000

In [23]:
df = pd.DataFrame({'date': ['3/10/2000', 'a/11/2000', '3/12/2000'],
                   'value': [2, 3, 4]})

df['date'] = pd.to_datetime(df['date'], errors = 'ignore')
print(df.dtypes)
df

date     object
value     int64
dtype: object

        date  value
0  3/10/2000      2
1  a/11/2000      3
2  3/12/2000      4

In [24]:
df = pd.DataFrame({'date': ['3/10/2000', 'a/11/2000', '3/12/2000'],
                   'value': [2, 3, 4]})

df['date'] = pd.to_datetime(df['date'], errors = 'coerce')
df

        date  value
0 2000-03-10      2
1        NaT      3
2 2000-03-12      4

In [25]:
df.dtypes

date     datetime64[ns]
value             int64
dtype: object

In [26]:
print(df.at[0, 'date'])
print(df.at[1, 'date'])

2000-03-10 00:00:00
NaT

### 4. Ensamblar una fecha y hora a partir de varias columnas

In [27]:
df = pd.DataFrame({'year': [2015, 2016],
                   'month': [2, 3],
                   'day': [4, 5]})

df

   year  month  day
0  2015      2    4
1  2016      3    5

In [30]:
df['date'] = pd.to_datetime(df)

ValueError: extra keys have been passed to the datetime assemblage: [date]

In [29]:
df

   year  month  day       date
0  2015      2    4 2015-02-04
1  2016      3    5 2016-03-05

In [31]:
df.dtypes

year              int64
month             int64
day               int64
date     datetime64[ns]
dtype: object

### 5. Obtener año, mes y día

In [36]:
df = pd.DataFrame({'name': ['Tom', 'Andy', 'Lucas'],
                 'DoB': ['12-12-2022', '04-28-1996', '12-16-1995']})

df['DoB'] = pd.to_datetime(df['DoB'])
df

    name        DoB
0    Tom 2022-12-12
1   Andy 1996-04-28
2  Lucas 1995-12-16

In [33]:
df['year'] = df['DoB'].dt.year
df['month'] = df['DoB'].dt.month
df['day'] = df['DoB'].dt.day
df

    name        DoB  year  month  day
0    Tom 1997-08-05  1997      8    5
1   Andy 1996-04-28  1996      4   28
2  Lucas 1995-12-16  1995     12   16

In [34]:
df.dtypes

name             object
DoB      datetime64[ns]
year              int64
month             int64
day               int64
dtype: object

### 6. Obtener la semana del año, el día de la semana y el año bisiesto

In [37]:
df['week_of_year'] = df['DoB'].dt.isocalendar().week
df['day_of_week'] = df['DoB'].dt.dayofweek
df['is_leap_year'] = df['DoB'].dt.is_leap_year
df

    name        DoB  week_of_year  day_of_week  is_leap_year
0    Tom 2022-12-12            50            0         False
1   Andy 1996-04-28            17            6          True
2  Lucas 1995-12-16            50            5         False

In [38]:
dw_mapping={
    0: 'Monday', 
    1: 'Tuesday', 
    2: 'Wednesday', 
    3: 'Thursday', 
    4: 'Friday',
    5: 'Saturday', 
    6: 'Sunday'
} 
df['day_of_week_name']=df['DoB'].dt.weekday.map(dw_mapping)
df

    name        DoB  week_of_year  day_of_week  is_leap_year day_of_week_name
0    Tom 2022-12-12            50            0         False           Monday
1   Andy 1996-04-28            17            6          True           Sunday
2  Lucas 1995-12-16            50            5         False         Saturday

### 7. Obtener la edad a partir de la fecha de nacimiento

In [39]:
pd.to_datetime('today')

Timestamp('2022-12-14 21:02:58.984924')

In [40]:
datetime.today()

datetime.datetime(2022, 12, 14, 21, 3, 12, 672144)

In [41]:
today = pd.to_datetime('today')
df['age'] = today.year - df['DoB'].dt.year

df

,name,DoB,week_of_year,day_of_week,is_leap_year,day_of_week_name,age
0,Tom,2022-12-12,50,0,False,Monday,0
1,Andy,1996-04-28,17,6,True,Sunday,26
2,Lucas,1995-12-16,50,5,False,Saturday,27

### 8. Mejorar el rendimiento estableciendo la columna de fecha como índice

In [42]:
df = pd.read_csv('data/city_sales.csv', parse_dates = ['date'])
df

                       date  num       city
0       2015-01-01 09:00:00    4     London
1       2015-01-01 09:01:00    4     London
2       2015-01-01 09:02:00    3     London
3       2015-01-01 09:03:00    3     London
4       2015-01-01 09:04:00    3     London
...                     ...  ...        ...
1795139 2019-01-31 15:56:00    3  Cambridge
1795140 2019-01-31 15:57:00    3  Cambridge
1795141 2019-01-31 15:58:00    3  Cambridge
1795142 2019-01-31 15:59:00    3  Cambridge
1795143 2019-01-31 16:00:00    2  Cambridge

[1795144 rows x 3 columns]

In [43]:
df.describe(include='all')

C:\Users\Fernando Carrasco\AppData\Roaming\Python\Python37\site-packages\ipykernel_launcher.py:1: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.
  """Entry point for launching an IPython kernel.

                       date           num     city
count               1795144  1.795144e+06  1795144
unique               448786           NaN        4
top     2015-01-01 09:00:00           NaN   London
freq                      4           NaN   448786
first   2015-01-01 09:00:00           NaN      NaN
last    2019-01-31 16:00:00           NaN      NaN
mean                    NaN  2.801503e+00      NaN
std                     NaN  8.714650e-01      NaN
min                     NaN  1.000000e+00      NaN
25%                     NaN  2.000000e+00      NaN
50%                     NaN  3.000000e+00      NaN
75%                     NaN  3.000000e+00      NaN
max                     NaN  4.000000e+00      NaN

In [44]:
4*448786

1795144

In [45]:
df.dtypes

date    datetime64[ns]
num              int64
city            object
dtype: object

In [46]:
df = pd.read_csv('data/city_sales.csv', parse_dates = ['date'])
df.set_index(['date'], inplace=True)
df.head()

                     num    city
date
2015-01-01 09:00:00    4  London
2015-01-01 09:01:00    4  London
2015-01-01 09:02:00    3  London
2015-01-01 09:03:00    3  London
2015-01-01 09:04:00    3  London

In [47]:
df = pd.read_csv('data/city_sales.csv', parse_dates = ['date'], index_col = 'date')
df.head()

                     num    city
date
2015-01-01 09:00:00    4  London
2015-01-01 09:01:00    4  London
2015-01-01 09:02:00    3  London
2015-01-01 09:03:00    3  London
2015-01-01 09:04:00    3  London

In [48]:
# Tenemos un DateTimeIndex
df.index

DatetimeIndex(['2015-01-01 09:00:00', '2015-01-01 09:01:00',
               '2015-01-01 09:02:00', '2015-01-01 09:03:00',
               '2015-01-01 09:04:00', '2015-01-01 09:05:00',
               '2015-01-01 09:06:00', '2015-01-01 09:07:00',
               '2015-01-01 09:08:00', '2015-01-01 09:09:00',
               ...
               '2019-01-31 15:51:00', '2019-01-31 15:52:00',
               '2019-01-31 15:53:00', '2019-01-31 15:54:00',
               '2019-01-31 15:55:00', '2019-01-31 15:56:00',
               '2019-01-31 15:57:00', '2019-01-31 15:58:00',
               '2019-01-31 15:59:00', '2019-01-31 16:00:00'],
              dtype='datetime64[ns]', name='date', length=1795144, freq=None)

In [49]:
from datetime import datetime
dates = pd.to_datetime([datetime(2015, 7, 3), '4th of July, 2015',
                       '2015-Jul-6', '07-07-2015', '20150708'])
dates

DatetimeIndex(['2015-07-03', '2015-07-04', '2015-07-06', '2015-07-07',
               '2015-07-08'],
              dtype='datetime64[ns]', freq=None)

### 9. Seleccionar los datos con un año específico y realizar la agregación

In [50]:
df.loc['2018']

                     num       city
date
2018-01-01 09:00:00    2     London
2018-01-01 09:01:00    1     London
2018-01-01 09:02:00    3     London
2018-01-01 09:03:00    3     London
2018-01-01 09:04:00    3     London
...                  ...        ...
2018-12-31 15:56:00    4  Cambridge
2018-12-31 15:57:00    2  Cambridge
2018-12-31 15:58:00    3  Cambridge
2018-12-31 15:59:00    3  Cambridge
2018-12-31 16:00:00    2  Cambridge

[439524 rows x 2 columns]

In [51]:
df.loc['2018', 'num'].head()

date
2018-01-01 09:00:00    2
2018-01-01 09:01:00    1
2018-01-01 09:02:00    3
2018-01-01 09:03:00    3
2018-01-01 09:04:00    3
Name: num, dtype: int64

In [52]:
df.loc['2018'].groupby('city').sum()

              num
city
Cambridge  308428
Durham     307965
London     307431
Oxford     307366

### 10. Seleccionar datos con un mes específico o un día específico del mes

In [53]:
df.loc['2018-5'].head()

                     num    city
date
2018-05-01 09:00:00    1  London
2018-05-01 09:01:00    4  London
2018-05-01 09:02:00    3  London
2018-05-01 09:03:00    2  London
2018-05-01 09:04:00    3  London

In [55]:
df.loc['2018-5-1'].head()

                     num    city
date
2018-05-01 09:00:00    1  London
2018-05-01 09:01:00    4  London
2018-05-01 09:02:00    3  London
2018-05-01 09:03:00    2  London
2018-05-01 09:04:00    3  London

In [56]:
cond = df.index.month == 2
df[cond].head()

                     num    city
date
2015-02-02 09:00:00    4  London
2015-02-02 09:01:00    3  London
2015-02-02 09:02:00    3  London
2015-02-02 09:03:00    2  London
2015-02-02 09:04:00    1  London

### 11. Seleccionar datos entre dos fechas

In [57]:
df.loc['2016':'2018']

C:\Users\Fernando Carrasco\AppData\Roaming\Python\Python37\site-packages\ipykernel_launcher.py:1: FutureWarning: Value based partial slicing on non-monotonic DatetimeIndexes with non-existing keys is deprecated and will raise a KeyError in a future Version.
  """Entry point for launching an IPython kernel.

                     num       city
date
2016-01-01 09:00:00    4     London
2016-01-01 09:01:00    3     London
2016-01-01 09:02:00    4     London
2016-01-01 09:03:00    4     London
2016-01-01 09:04:00    2     London
...                  ...        ...
2018-12-31 15:56:00    4  Cambridge
2018-12-31 15:57:00    2  Cambridge
2018-12-31 15:58:00    3  Cambridge
2018-12-31 15:59:00    3  Cambridge
2018-12-31 16:00:00    2  Cambridge

[1316888 rows x 2 columns]

In [58]:
df.loc['2018-5-2 10' : '2018-5-2 11' ]

                     num       city
date
2018-05-02 10:00:00    2     London
2018-05-02 10:01:00    3     London
2018-05-02 10:02:00    4     London
2018-05-02 10:03:00    4     London
2018-05-02 10:04:00    4     London
...                  ...        ...
2018-05-02 11:55:00    3  Cambridge
2018-05-02 11:56:00    3  Cambridge
2018-05-02 11:57:00    4  Cambridge
2018-05-02 11:58:00    4  Cambridge
2018-05-02 11:59:00    1  Cambridge

[480 rows x 2 columns]

In [59]:
df.loc['2018-5-2 10:30' : '2018-5-2 10:45' ]

                     num       city
date
2018-05-02 10:30:00    3     London
2018-05-02 10:31:00    3     London
2018-05-02 10:32:00    1     London
2018-05-02 10:33:00    3     London
2018-05-02 10:34:00    3     London
...                  ...        ...
2018-05-02 10:41:00    3  Cambridge
2018-05-02 10:42:00    3  Cambridge
2018-05-02 10:43:00    3  Cambridge
2018-05-02 10:44:00    3  Cambridge
2018-05-02 10:45:00    1  Cambridge

[64 rows x 2 columns]

In [60]:
df.between_time('10:30','10:45')

                     num       city
date
2015-01-01 10:30:00    4     London
2015-01-01 10:31:00    3     London
2015-01-01 10:32:00    3     London
2015-01-01 10:33:00    3     London
2015-01-01 10:34:00    4     London
...                  ...        ...
2019-01-31 10:41:00    3  Cambridge
2019-01-31 10:42:00    3  Cambridge
2019-01-31 10:43:00    1  Cambridge
2019-01-31 10:44:00    3  Cambridge
2019-01-31 10:45:00    4  Cambridge

[68224 rows x 2 columns]

In [61]:
df.shape

(1795144, 2)

### 12. Operaciones con fechas

In [62]:
df = pd.DataFrame({'name': ['Tom', 'Andy', 'Lucas'],
                 'DoB': ['08-05-1997', '04-28-1996', '12-16-1995']})

df['DoB'] = pd.to_datetime(df['DoB'])
df

    name        DoB
0    Tom 1997-08-05
1   Andy 1996-04-28
2  Lucas 1995-12-16

In [63]:
from pandas.tseries.offsets import DateOffset, BDay

print(df['DoB'] + DateOffset(days = 5))
print(df['DoB'] + DateOffset(days = -5))
print(df['DoB'] + DateOffset(months = 5))

0   1997-08-10
1   1996-05-03
2   1995-12-21
Name: DoB, dtype: datetime64[ns]
0   1997-07-31
1   1996-04-23
2   1995-12-11
Name: DoB, dtype: datetime64[ns]
0   1998-01-05
1   1996-09-28
2   1996-05-16
Name: DoB, dtype: datetime64[ns]

In [64]:
BDay(10)

In [ ]:
print(df['DoB'])
print(df['DoB'] + BDay(10))

In [65]:
df['DoB+10BD'] = df['DoB'] + BDay(10)
df

    name        DoB   DoB+10BD
0    Tom 1997-08-05 1997-08-19
1   Andy 1996-04-28 1996-05-10
2  Lucas 1995-12-16 1995-12-29

In [66]:
df['date_diff'] = (df['DoB+10BD'] - df['DoB']).dt.days
df

    name        DoB   DoB+10BD  date_diff
0    Tom 1997-08-05 1997-08-19         14
1   Andy 1996-04-28 1996-05-10         12
2  Lucas 1995-12-16 1995-12-29         13

In [67]:
df.dtypes

name                 object
DoB          datetime64[ns]
DoB+10BD     datetime64[ns]
date_diff             int64
dtype: object

### 13. Secuencias Regulares: ``pd.date_range()``

Para hacer más cómoda la creación de secuencias de **fechas regulares**, Pandas ofrece unas cuantas funciones para este propósito: ``pd.date_range()`` para timestamps, ``pd.period_range()`` para periodos, y ``pd.timedelta_range()`` para deltas de tiempo.
Hemos visto que **`range()`` de Python y ``np.arange()``** de NumPy convierten un punto de inicio, un punto final y un tamaño de paso o step opcional en una secuencia.
Del mismo modo, ``pd.date_range()`` acepta una fecha inicial, una fecha final y un código de frecuencia opcional para crear una secuencia regular de fechas.
Por defecto, la frecuencia es de un día:

In [68]:
pd.date_range('2015-07-03', '2015-07-10')

DatetimeIndex(['2015-07-03', '2015-07-04', '2015-07-05', '2015-07-06',
               '2015-07-07', '2015-07-08', '2015-07-09', '2015-07-10'],
              dtype='datetime64[ns]', freq='D')

Alternativamente, el intervalo de fechas puede especificarse no con un punto de inicio y un punto final, sino con un punto de inicio y un número de periodos:

In [69]:
pd.date_range('2015-07-03', periods = 8)

DatetimeIndex(['2015-07-03', '2015-07-04', '2015-07-05', '2015-07-06',
               '2015-07-07', '2015-07-08', '2015-07-09', '2015-07-10'],
              dtype='datetime64[ns]', freq='D')

El espaciado puede modificarse alterando el argumento ``freq``, que por defecto es ``D``.
Por ejemplo, aquí construiremos un rango de marcas de tiempo horarias:

In [70]:
pd.date_range('2015-01-01', periods = 12, freq='M')

DatetimeIndex(['2015-01-31', '2015-02-28', '2015-03-31', '2015-04-30',
               '2015-05-31', '2015-06-30', '2015-07-31', '2015-08-31',
               '2015-09-30', '2015-10-31', '2015-11-30', '2015-12-31'],
              dtype='datetime64[ns]', freq='M')

### 14. Trabajando con valores perdidos

In [71]:
# Creamos algunos missings aposta con la rolling window
df = pd.read_csv('data/city_sales.csv', parse_dates=['date'], index_col='date')
df

                     num       city
date
2015-01-01 09:00:00    4     London
2015-01-01 09:01:00    4     London
2015-01-01 09:02:00    3     London
2015-01-01 09:03:00    3     London
2015-01-01 09:04:00    3     London
...                  ...        ...
2019-01-31 15:56:00    3  Cambridge
2019-01-31 15:57:00    3  Cambridge
2019-01-31 15:58:00    3  Cambridge
2019-01-31 15:59:00    3  Cambridge
2019-01-31 16:00:00    2  Cambridge

[1795144 rows x 2 columns]

In [72]:
df['rolling_sum'] = df.rolling(3).sum()
df.head()

                     num    city  rolling_sum
date
2015-01-01 09:00:00    4  London          NaN
2015-01-01 09:01:00    4  London          NaN
2015-01-01 09:02:00    3  London         11.0
2015-01-01 09:03:00    3  London         10.0
2015-01-01 09:04:00    3  London          9.0

In [73]:
df['rolling_sum_back'] = df['rolling_sum'].fillna(method = 'backfill')
df.head()

                     num    city  rolling_sum  rolling_sum_back
date
2015-01-01 09:00:00    4  London          NaN              11.0
2015-01-01 09:01:00    4  London          NaN              11.0
2015-01-01 09:02:00    3  London         11.0              11.0
2015-01-01 09:03:00    3  London         10.0              10.0
2015-01-01 09:04:00    3  London          9.0               9.0

In [74]:
# Creating the dataframe 
df = pd.DataFrame({"A":[12, 4, 5, None, 1],
                   "B":[None, 2, 54, 3, None],
                   "C":[20, 16, None, 3, 8],
                   "D":[14, 3, None, None, 6]})
  
# Print the dataframe
df

      A     B     C     D
0  12.0   NaN  20.0  14.0
1   4.0   2.0  16.0   3.0
2   5.0  54.0   NaN   NaN
3   NaN   3.0   3.0   NaN
4   1.0   NaN   8.0   6.0

In [75]:
df.interpolate(method = 'linear')

      A     B     C     D
0  12.0   NaN  20.0  14.0
1   4.0   2.0  16.0   3.0
2   5.0  54.0   9.5   4.0
3   3.0   3.0   3.0   5.0
4   1.0   3.0   8.0   6.0

### 15. Resampling, Windowing and Shifting

In [ ]:
goog = pd.read_csv('data/GOOG.csv')
goog['Date'] =  pd.to_datetime(goog['Date'])
goog.set_index('Date', inplace=True)
goog

In [ ]:
goog.head(10)

In [ ]:
goog.info()

In [ ]:
# goog = goog['Close']
goog = goog.fillna(method='ffill')
goog

In [ ]:
goog['Close'].plot();

In [ ]:
goog.resample('BA').mean()

In [ ]:
goog.asfreq('BA')

In [ ]:
goog.loc['2012-12-31']

In [ ]:
import matplotlib.pyplot as plt
plt.figure(figsize=(10,10))
goog['Close'].plot(alpha=0.5, style='-')
goog['Close'].resample('BA').mean().plot(style=':')
goog['Close'].asfreq('BA').plot(style='--');

plt.legend(['input', 'resample', 'asfreq'],
           loc='upper left');

In [ ]:
print(goog.resample('BA').mean()[-1:])

In [ ]:
print(goog.resample('BA').mean()[-1:])
goog.loc['2020'].mean()

In [ ]:
goog.asfreq('BA')

| Code   | Description         | Code   | Description          |
|--------|---------------------|--------|----------------------|
| ``D``  | Calendar day        | ``B``  | Business day         |
| ``W``  | Weekly              |        |                      |
| ``M``  | Month end           | ``BM`` | Business month end   |
| ``Q``  | Quarter end         | ``BQ`` | Business quarter end |
| ``A``  | Year end            | ``BA`` | Business year end    |
| ``H``  | Hours               | ``BH`` | Business hours       |
| ``T``  | Minutes             |        |                      |
| ``S``  | Seconds             |        |                      |
| ``L``  | Milliseonds         |        |                      |
| ``U``  | Microseconds        |        |                      |
| ``N``  | nanoseconds         |        |                      |

In [ ]:
goog = goog['Close']

In [ ]:
goog.shift(1)

In [ ]:
pd.DataFrame({'Data': goog,
             'Data-1': goog.shift(1),
             'Diff': goog - goog.shift(1),
             '%Crec': round(((goog - goog.shift(1))/goog)*100,2)})

In [ ]:
# Calcular el ROI de la inversión
ROI = 100 * (goog - goog.shift(261)) / goog.shift(261)
ROI.plot()
plt.ylabel('% Return on Investment');

### 16. Rolling window

In [ ]:
rolling = goog.rolling(261, center=True) # 365 - weekends (aprox(52*2))
rolling

In [ ]:
rolling.mean()

In [ ]:
rolling = goog.rolling(261, center=True)

data = pd.DataFrame({'input': goog,
                     'one-year rolling_mean': rolling.mean(),
                     'one-year rolling_std': rolling.std()})

ax = data.plot(style=['-', '--', ':'])
ax.lines[0].set_alpha(0.3)